In [1]:
import pandas as pd

In [2]:
ticker_list = pd.read_csv("../Data/non_word_tickers.csv")

In [3]:
ticker_list

         0    count
0      GME  53911.0
1      AMC  22993.0
2      NOK   6498.0
3     ELSE   3348.0
4       TD   1248.0
...    ...      ...
1244   SAR      1.0
1245   LYG      1.0
1246   KMT      1.0
1247  ZYXI      1.0
1248  SPRT      1.0

[1249 rows x 2 columns]

In [4]:
ticker_list = ticker_list[ticker_list["count"] >= 100]

In [5]:
ticker_list

       0    count
0    GME  53911.0
1    AMC  22993.0
2    NOK   6498.0
3   ELSE   3348.0
4     TD   1248.0
5   NAKD   1180.0
6   APPS   1089.0
7   PLTR    923.0
8   SNDL    919.0
9    SLV    868.0
10  TSLA    667.0
11  ONTO    561.0
12   NIO    435.0
13   CUZ    364.0
14  BBBY    280.0
15     0    267.0
16   AAL    254.0
17    ST    241.0
18  EXPR    241.0
19  SPCE    231.0
20   JOE    225.0
21   PPL    201.0
22  CTRM    183.0
23  ALOT    171.0
24  CCIV    161.0
25  FUBO    137.0
26    JP    130.0
27  AAPL    124.0
28    ET    120.0
29   MSM    119.0
30    FB    113.0
31  TLRY    106.0
32   BRO    105.0
33  CRSR    105.0
34  IBKR    105.0
35   BIO    100.0

In [6]:
ticker_list = ticker_list[ticker_list["0"] != "0"]

In [7]:
ticker_list

       0    count
0    GME  53911.0
1    AMC  22993.0
2    NOK   6498.0
3   ELSE   3348.0
4     TD   1248.0
5   NAKD   1180.0
6   APPS   1089.0
7   PLTR    923.0
8   SNDL    919.0
9    SLV    868.0
10  TSLA    667.0
11  ONTO    561.0
12   NIO    435.0
13   CUZ    364.0
14  BBBY    280.0
16   AAL    254.0
17    ST    241.0
18  EXPR    241.0
19  SPCE    231.0
20   JOE    225.0
21   PPL    201.0
22  CTRM    183.0
23  ALOT    171.0
24  CCIV    161.0
25  FUBO    137.0
26    JP    130.0
27  AAPL    124.0
28    ET    120.0
29   MSM    119.0
30    FB    113.0
31  TLRY    106.0
32   BRO    105.0
33  CRSR    105.0
34  IBKR    105.0
35   BIO    100.0

In [8]:
ticker_list['Tickers'] = ticker_list["0"]

In [9]:
ticker_list = ticker_list.drop(["count", "0"],1)

In [10]:
ticker_list

   Tickers
0      GME
1      AMC
2      NOK
3     ELSE
4       TD
5     NAKD
6     APPS
7     PLTR
8     SNDL
9      SLV
10    TSLA
11    ONTO
12     NIO
13     CUZ
14    BBBY
16     AAL
17      ST
18    EXPR
19    SPCE
20     JOE
21     PPL
22    CTRM
23    ALOT
24    CCIV
25    FUBO
26      JP
27    AAPL
28      ET
29     MSM
30      FB
31    TLRY
32     BRO
33    CRSR
34    IBKR
35     BIO

In [11]:
shorted_list = pd.read_csv("../Data/shorted_tickers.csv")

In [12]:
final_ticker_list = shorted_list.append(ticker_list)

In [13]:
final_ticker_list = final_ticker_list.drop_duplicates()

In [14]:
final_ticker_list.to_csv("../Data/final_ticker_list.csv", index=False)